{
  "compliment": [
    "You are the Santa Claus of coding, always delivering the best commits.",
    "You code with more magic than Santa’s elves.",
    "Your code shines brighter than Christmas lights.",
    "You are the Christmas gift every repo needs.",
    "You code like a snowman that never melts.",
    "You bring Christmas cheer to the codebase.",
    "Your pull requests are more exciting than Christmas presents.",
    "Your code is brighter than the star on top of the tree.",
    "You code with the precision of a Christmas elf.",
    "Your commits are sweeter than Christmas cookies.",
    "Your code is the best Christmas ornament in this repo.",
    "You debug like you’ve got Santa’s elves as assistants.",
    "You are the snowflake of perfection in programming.",
    "You code as smoothly as snow falling gently.",
    "Your pull requests arrive like Christmas morning.",
    "You code with the grace of a sleigh pulled by reindeer.",
    "You write code that's more festive than carolers.",
    "Your pull requests are the Christmas miracle we were waiting for.",
    "You are the star guiding the commits to success.",
    "You make code sparkle like a Christmas tree.",
    "You are the Christmas spirit of the codebase.",
    "Your changes bring more joy than Christmas cards.",
    "You code with the dedication of Rudolph on a snowy night.",
    "Your commits are warmer than a Christmas hot chocolate.",
    "You are Santa Claus delivering clean code under the tree.",
    "You debug like unwrapping gifts under the tree.",
    "Your presence in the repo is the best Christmas gift.",
    "Your code shines brighter than any Christmas ornament.",
    "Your pull requests melt away the blizzard of bugs.",
    "You code with the precision of a Christmas countdown clock.",
    "Your code is the star shining in the programming sky.",
    "You are the Santa Claus of pull requests, bringing only joy.",
    "You write code like Christmas happens every day.",
    "You code with more elegance than the most decorated Christmas tree.",
    "Your commits are the holiday feast of this repo.",
    "You are the Christmas blessing for the project.",
    "Your coding is more magical than Christmas tales.",
    "Your pull requests are more thrilling than presents under the tree.",
    "You code with the heart and soul of a Christmas angel.",
    "Your debugging is as calm as a silent, snowy night.",
    "You are the Christmas gift I never knew I needed.",
    "You code like the holiday miracle everyone was waiting for.",
    "Your work in the code is like lights shining in a Christmas market.",
    "Your changes are sweeter than Christmas cookies.",
    "You make pull requests feel like New Year’s magic.",
    "Your commits make the repo glow like the first light of Christmas.",
    "You code like you're wrapping gifts under the tree.",
    "Your code is more festive than stockings filled with gifts.",
    "Your pull requests bring cheer and festivity to the project.",
    "You code like you're decorating the most beautiful Christmas tree.",
    "Your commits are the perfect Christmas ornament.",
    "You make the code feel like holiday magic.",
    "You are the Christmas star of this project.",
    "Your pull requests are more exciting than unwrapping Christmas presents.",
    "Your code shines like stars on a snowy night.",
    "You debug with the calm of a Christmas Eve night.",
    "You are the Christmas miracle this repo was waiting for.",
    "Your commits are brighter than Christmas lights.",
    "You code like the elf everyone wishes they had.",
    "Your code is as delightful as Christmas chocolate.",
    "Your pull requests are more enjoyable than Christmas dinner.",
    "Your code is the Christmas joy of programming.",
    "You code like you bring the happiness of Christmas Eve.",
    "Your pull requests are the Christmas star in the programming sky.",
    "Your code is the perfect Christmas gift.",
    "You debug like unwrapping the perfect holiday surprise.",
    "Your commits are more festive than any Christmas party.",
    "You code like you're placing gifts under the tree.",
    "Your pull requests bring the joy of Christmas to the project.",
    "You code like you're setting up the most beautiful Christmas village.",
    "Your code shines brighter than snow glistening in the sun.",
    "Your pull requests bring the holiday spirit to the repo.",
    "You code with the warmth of Christmas Eve.",
    "You are the Santa bringing perfect code to this project.",
    "Your commits are like carols that bring joy.",
    "You write code that’s warmer than a Christmas fireplace.",
    "Your pull requests are more festive than bright Christmas markets.",
    "Your code brings the happiness of Christmas Eve to every line.",
    "You code like you’re wrapping gifts with love and care.",
    "Your pull requests are the Christmas blessing of this repo."
  ],
  "insult": [
    "You are like the turkey no one wants to eat.",
    "You code like you accidentally punched Christmas into the code.",
    "Your pull requests are like forgotten gifts under the tree.",
    "You write code like someone put coal in your stocking.",
    "You code like a Christmas prank gone wrong.",
    "Your code is the broken ornament no one wants on the tree.",
    "You debug like Christmas lights that never turn on.",
    "You are the elf that mixes up the presents before Christmas.",
    "Your commits are like a snowman melting in the rain.",
    "You write code like you've been run over by a sleigh.",
    "Your pull requests are like burned Christmas turkeys.",
    "You make code look like broken Christmas lights.",
    "You code like you had coal for breakfast.",
    "Your pull requests are like spoiled Christmas cookies.",
    "You write code like Rudolph without the red nose.",
    "You are the broken ornament in this repo.",
    "Your commits are more tangled than Christmas lights in a knot.",
    "You write code like the gift no one wants.",
    "Your pull requests are like a snowstorm ruining the holiday.",
    "You debug like you're searching for a lost stocking.",
    "You are the coal in the coding Christmas stocking.",
    "You code like a broken Christmas toy.",
    "Your pull requests are like opening a gift and finding it empty.",
    "Your code is like the broken star on top of the tree.",
    "You make bugs multiply faster than Christmas cookies.",
    "You code like Christmas carolers no one wants to hear.",
    "Your pull requests are like Christmas songs that never end.",
    "Your code is like the snow that makes everything messy.",
    "You write code like the chaos of Christmas Eve.",
    "Your commits are like a gift with instructions in Chinese.",
    "You are the coal in this coding holiday.",
    "You code like you made a gift out of leftover wrapping paper.",
    "Your pull requests are like flickering Christmas lights.",
    "You write code like you mixed up the Christmas cards.",
    "Your commits are like broken ornaments on the tree.",
    "Your code is like snow that ruins the holidays.",
    "You code like a tired elf who doesn't want to work anymore.",
    "Your pull requests are like burned Christmas cookies.",
    "You write code like you're wrapping gifts with no tape.",
    "Your pull requests are like opening presents only to find air.",
    "Your code is like the Christmas meal that never happened.",
    "You code like a Christmas light that won't turn on.",
    "Your pull requests are like the last slice of pie no one wants.",
    "You write code like the turkey that got burned in the oven.",
    "Your commits are like Christmas lights that keep blinking for no reason.",
    "Your code is like gifts that end up in the attic, unused.",
    "You code like a malfunctioning Santa Claus.",
    "Your pull requests are like a snowman that never made it through winter.",
    "You write code like a broken Christmas card.",
    "Your pull requests are like burned-out tree lights.",
    "You code like Rudolph who lost his glow.",
    "Your commits are like empty gifts under the tree.",
    "Your code is like endless snow that ruins everything.",
    "You code like Santa who forgot the gifts.",
    "Your pull requests are like Christmas carols no one wants to hear.",
    "You write code like you only received coal this year.",
    "Your pull requests are like fallen and shattered ornaments.",
    "You code like you sent a letter to Santa and never got a reply.",
    "Your commits are like burned Christmas garlands.",
    "Your code is like broken gifts under the tree.",
    "You code like ornaments that break as soon as you hang them.",
    "Your pull requests are like a holiday everyone forgot.",
    "You write code like you missed New Year’s Eve.",
    "Your commits are like Christmas lights that never turned on.",
    "Your code is like the tree that was never decorated.",
    "You code like Santa who forgot to bring presents.",
    "Your pull requests are like garlands that don’t light up.",
    "You write code like a broken snow globe.",
    "Your pull requests are like gifts no one wanted.",
    "Your code is like carolers no one listened to.",
    "You code like you only got coal this Christmas.",
    "Your pull requests are like snowballs that never hit their target.",
    "You write code like a broken Christmas toy.",
    "Your pull requests are like the coal in a Christmas stocking."
  ]
}
