{
  "compliment": [
    "Είσαι ο Άγιος Βασίλης του προγραμματισμού, πάντα φέρνεις τα καλύτερα commits.",
    "Κωδικοποιείς με περισσότερη μαγεία από τα ξωτικά του Άγιου Βασίλη.",
    "Η γραφή σου είναι πιο φωτεινή από τα χριστουγεννιάτικα λαμπάκια.",
    "Είσαι το χριστουγεννιάτικο δώρο που κάθε repo χρειάζεται.",
    "Προγραμματίζεις σαν χιονάνθρωπος που δε λιώνει ποτέ.",
    "Είσαι ο λόγος που η χριστουγεννιάτικη διάθεση επεκτείνεται και στον κώδικα.",
    "Τα pull requests σου είναι πιο συναρπαστικά από τα χριστουγεννιάτικα δώρα.",
    "Ο κώδικάς σου είναι πιο λαμπερός από το αστέρι στην κορυφή του δέντρου.",
    "Προγραμματίζεις με την ακρίβεια ενός χριστουγεννιάτικου ξωτικού.",
    "Τα commits σου είναι πιο γλυκά από τα μελομακάρονα.",
    "Ο κώδικάς σου είναι το καλύτερο χριστουγεννιάτικο στολίδι σε αυτό το repo.",
    "Κάνεις debugging σαν να έχεις βοηθούς τα ξωτικά του Βόρειου Πόλου.",
    "Είσαι η χιονονιφάδα της τελειότητας στον προγραμματισμό.",
    "Ο τρόπος που προγραμματίζεις μοιάζει με την ομαλή πτώση του χιονιού.",
    "Τα pull requests σου έρχονται σαν Χριστούγεννα νωρίς.",
    "Κωδικοποιείς με τη χάρη ενός έλκηθρου που τραβούν ταράνδοι.",
    "Γράφεις κώδικα που είναι πιο γιορτινός και από τα κάλαντα.",
    "Τα pull requests σου είναι το χριστουγεννιάτικο θαύμα που όλοι περιμέναμε.",
    "Είσαι το αστέρι που οδηγεί τα commits στον σωστό δρόμο.",
    "Κάνεις το κώδικα να λάμπει σαν χριστουγεννιάτικο δέντρο.",
    "Είσαι το χριστουγεννιάτικο πνεύμα του κώδικα.",
    "Οι αλλαγές σου είναι πιο χαρούμενες από χριστουγεννιάτικες κάρτες.",
    "Προγραμματίζεις με την αφοσίωση του Ρούντολφ σε μια χιονισμένη νύχτα.",
    "Τα commits σου είναι πιο ζεστά και από χριστουγεννιάτικη σοκολάτα.",
    "Είσαι ο Άγιος Βασίλης που φέρνει καθαρό κώδικα κάτω από το χριστουγεννιάτικο δέντρο.",
    "Κάνεις debugging σαν να ανακαλύπτεις τα δώρα κάτω από το δέντρο.",
    "Η παρουσία σου σε αυτό το repo είναι σαν το καλύτερο δώρο των Χριστουγέννων.",
    "Ο κώδικάς σου είναι πιο λαμπερός από κάθε χριστουγεννιάτικο στολίδι.",
    "Τα pull requests σου κάνουν τη χιονοθύελλα των bugs να εξαφανίζεται.",
    "Κωδικοποιείς με την ακρίβεια ενός χριστουγεννιάτικου ρολογιού αντίστροφης μέτρησης.",
    "Ο κώδικάς σου είναι το αστέρι που λάμπει στον προγραμματιστικό ουρανό.",
    "Είσαι ο Άγιος Βασίλης των pull requests, φέρνεις μόνο χαρά.",
    "Ο τρόπος που γράφεις κώδικα είναι σαν να φέρνεις Χριστούγεννα κάθε μέρα.",
    "Κωδικοποιείς με περισσότερη χάρη και από το πιο καλοστολισμένο δέντρο.",
    "Τα commits σου είναι το γιορτινό τραπέζι αυτού του repo.",
    "Είσαι η χριστουγεννιάτικη ευλογία για το project.",
    "Ο προγραμματισμός σου είναι πιο μαγικός και από τα χριστουγεννιάτικα παραμύθια.",
    "Τα pull requests σου είναι πιο συναρπαστικά από τα δώρα κάτω από το δέντρο.",
    "Κωδικοποιείς με την καρδιά και την ψυχή ενός χριστουγεννιάτικου αγγέλου.",
    "Ο τρόπος που κάνεις debugging είναι πιο ήρεμος από μια χιονισμένη νύχτα.",
    "Είσαι το χριστουγεννιάτικο δώρο που ποτέ δεν ήξερα ότι χρειαζόμουν.",
    "Κωδικοποιείς σαν το γιορτινό θαύμα που όλοι περιμέναμε.",
    "Η δουλειά σου στον κώδικα είναι σαν τα φώτα που λάμπουν σε μια χριστουγεννιάτικη αγορά.",
    "Οι αλλαγές σου είναι πιο γλυκές και από τα χριστουγεννιάτικα μπισκότα.",
    "Κάνεις τα pull requests να μοιάζουν με τη μαγεία της Πρωτοχρονιάς.",
    "Τα commits σου κάνουν το repo να λάμπει σαν το πρώτο φως των Χριστουγέννων.",
    "Προγραμματίζεις σαν να τυλίγεις δώρα κάτω από το χριστουγεννιάτικο δέντρο.",
    "Ο κώδικάς σου είναι πιο γιορτινός από χριστουγεννιάτικες κάλτσες γεμάτες δώρα.",
    "Τα pull requests σου φέρνουν χαρά και γιορτή στο project.",
    "Κωδικοποιείς σαν να στολίζεις το πιο εντυπωσιακό χριστουγεννιάτικο δέντρο.",
    "Τα commits σου είναι το τέλειο χριστουγεννιάτικο στολίδι.",
    "Κάνεις τον κώδικα να μοιάζει με γιορτινή μαγεία.",
    "Είσαι το χριστουγεννιάτικο άστρο αυτού του project.",
    "Τα pull requests σου είναι πιο συναρπαστικά από το να ανοίγεις δώρα Χριστουγέννων.",
    "Γράφεις κώδικα που λάμπει όπως τα αστέρια μια χιονισμένη νύχτα.",
    "Κάνεις debugging με την ηρεμία της Χριστουγεννιάτικης νύχτας.",
    "Είσαι το χριστουγεννιάτικο θαύμα που περίμενε αυτό το repo.",
    "Τα commits σου είναι πιο λαμπερά από χριστουγεννιάτικα λαμπιόνια.",
    "Προγραμματίζεις σαν το ξωτικό του Άγιου Βασίλη που όλοι θέλουμε.",
    "Ο κώδικάς σου είναι τόσο απολαυστικός όσο η γιορτινή σοκολάτα.",
    "Τα pull requests σου είναι πιο ευχάριστα και από το χριστουγεννιάτικο δείπνο.",
    "Ο κώδικάς σου είναι η χριστουγεννιάτικη χαρά του προγραμματισμού.",
    "Προγραμματίζεις σαν να φέρνεις την ευτυχία της παραμονής των Χριστουγέννων.",
    "Τα pull requests σου είναι το χριστουγεννιάτικο αστέρι στον ουρανό του προγραμματισμού.",
    "Ο κώδικάς σου είναι το τέλειο χριστουγεννιάτικο δώρο.",
    "Κάνεις debugging σαν να ξετυλίγεις την τέλεια γιορτινή έκπληξη.",
    "Τα commits σου είναι πιο γιορτινά από κάθε χριστουγεννιάτικο πάρτι.",
    "Ο τρόπος που προγραμματίζεις είναι σαν να βάζεις τα δώρα κάτω από το δέντρο.",
    "Τα pull requests σου φέρνουν τη χαρά των Χριστουγέννων στο project.",
    "Κωδικοποιείς σαν να στήνεις το πιο όμορφο χριστουγεννιάτικο χωριό.",
    "Ο κώδικάς σου είναι πιο λαμπερός και από το χιόνι που λάμπει στον ήλιο.",
    "Τα pull requests σου είναι η χριστουγεννιάτικη διάθεση του repo.",
    "Προγραμματίζεις με τη ζεστασιά της παραμονής Χριστουγέννων.",
    "Είσαι ο Άγιος Βασίλης που φέρνει τέλειο κώδικα σε αυτό το project.",
    "Τα commits σου είναι σαν γιορτινά τραγούδια που φέρνουν χαρά.",
    "Γράφεις κώδικα που είναι πιο ζεστός και από το χριστουγεννιάτικο τζάκι.",
    "Τα pull requests σου είναι πιο γιορτινά από φωτεινές χριστουγεννιάτικες αγορές.",
    "Ο κώδικάς σου φέρνει την ευτυχία της παραμονής των Χριστουγέννων σε κάθε γραμμή.",
    "Προγραμματίζεις σαν να τυλίγεις δώρα με αγάπη και φροντίδα.",
    "Τα pull requests σου είναι η χριστουγεννιάτικη ευλογία αυτού του repo."
  ],
  "insult": [
    "Είσαι σαν τη γαλοπούλα που κανείς δεν θέλει να φάει.",
    "Κωδικοποιείς σαν να έριξες κατά λάθος τη γιορτινή γροθιά στον κώδικα.",
    "Τα pull requests σου είναι σαν τα δώρα που ξεχνιούνται κάτω από το δέντρο.",
    "Γράφεις κώδικα σαν κάποιος να έβαλε κάρβουνο στη χριστουγεννιάτικη κάλτσα σου.",
    "Κωδικοποιείς σαν χριστουγεννιάτικη φάρσα που πήγε στραβά.",
    "Ο κώδικάς σου είναι το σπασμένο στολίδι που δεν θέλουμε στο δέντρο.",
    "Κάνεις debugging σαν τα φώτα του δέντρου που δεν ανάβουν ποτέ.",
    "Είσαι το ξωτικό που μπερδεύει τα δώρα πριν τα Χριστούγεννα.",
    "Τα commits σου είναι σαν χιονάνθρωπος που λιώνει στη βροχή.",
    "Γράφεις κώδικα σαν να σε πάτησε έλκηθρο.",
    "Τα pull requests σου είναι σαν τις καμένες χριστουγεννιάτικες γαλοπούλες.",
    "Κάνεις τον κώδικα να μοιάζει με χαλασμένα χριστουγεννιάτικα λαμπάκια.",
    "Κωδικοποιείς σαν να έφαγες κάρβουνο για πρωινό.",
    "Τα pull requests σου είναι σαν χαλασμένα μελομακάρονα.",
    "Γράφεις κώδικα σαν τον Ρούντολφ χωρίς την κόκκινη μύτη.",
    "Είσαι το σπασμένο στολίδι σε αυτό το repo.",
    "Τα commits σου είναι πιο μπερδεμένα και από τα χριστουγεννιάτικα φωτάκια πριν ξεμπερδευτούν.",
    "Γράφεις κώδικα σαν το τελευταίο δώρο που κανείς δεν θέλει.",
    "Τα pull requests σου είναι σαν τη χιονοθύελλα που χαλάει τη γιορτή.",
    "Κάνεις debugging σαν να προσπαθείς να βρεις το χαμένο κάλτσα.",
    "Είσαι το κάρβουνο στη χριστουγεννιάτικη κάλτσα του προγραμματισμού.",
    "Κωδικοποιείς σαν χαλασμένο χριστουγεννιάτικο παιχνίδι.",
    "Τα pull requests σου είναι σαν να ανοίγεις ένα δώρο και να είναι άδειο.",
    "Ο κώδικάς σου είναι σαν το χαλασμένο αστέρι στην κορυφή του δέντρου.",
    "Κάνεις τα bugs να πολλαπλασιάζονται πιο γρήγορα από τα χριστουγεννιάτικα μπισκότα.",
    "Κωδικοποιείς σαν τα κάλαντα που κανείς δεν θέλει να ακούσει.",
    "Τα pull requests σου είναι σαν τα χριστουγεννιάτικα τραγούδια που δεν τελειώνουν ποτέ.",
    "Ο κώδικάς σου είναι σαν τα χιόνια που κάνουν τα πάντα ακατάστατα.",
    "Γράφεις κώδικα σαν να είσαι το χάος της παραμονής των Χριστουγέννων.",
    "Τα commits σου είναι σαν το δώρο που έρχεται με οδηγίες στα κινέζικα.",
    "Είσαι σαν το κάρβουνο σε αυτήν την κωδικοποιητική γιορτή.",
    "Κωδικοποιείς σαν να έφτιαξες δώρο από παλιά χαρτιά περιτυλίγματος.",
    "Τα pull requests σου είναι σαν χριστουγεννιάτικα λαμπιόνια που συνεχώς τρεμοπαίζουν.",
    "Γράφεις κώδικα σαν να ανακάτεψες τη χριστουγεννιάτικη κάρτα λάθος.",
    "Τα commits σου είναι σαν τα σπασμένα στολίδια στο δέντρο.",
    "Ο κώδικάς σου είναι σαν τα χιόνια που καταστρέφουν τις διακοπές.",
    "Κωδικοποιείς σαν το κουρασμένο ξωτικό που δεν θέλει να δουλέψει πια.",
    "Τα pull requests σου είναι σαν τα χριστουγεννιάτικα μπισκότα που κάηκαν.",
    "Γράφεις κώδικα σαν να τυλίγεις δώρα χωρίς κολλητική ταινία.",
    "Τα pull requests σου είναι σαν να ανοίγεις δώρα και να βρίσκεις μόνο αέρα.",
    "Ο κώδικάς σου είναι σαν το χριστουγεννιάτικο γεύμα που δεν έγινε ποτέ.",
    "Κωδικοποιείς σαν χριστουγεννιάτικο φως που δεν ανάβει.",
    "Τα pull requests σου είναι σαν το τελευταίο κομμάτι της πίτας που κανείς δεν θέλει.",
    "Γράφεις κώδικα σαν τη γαλοπούλα που κάηκε στον φούρνο.",
    "Τα commits σου είναι σαν τα χριστουγεννιάτικα φώτα που αναβοσβήνουν χωρίς λόγο.",
    "Ο κώδικάς σου είναι σαν τα δώρα που καταλήγουν σε πατάρι αχρησιμοποίητα.",
    "Κωδικοποιείς σαν χαλασμένος Άγιος Βασίλης.",
    "Τα pull requests σου είναι σαν χιονάνθρωπος που δεν έφτασε ποτέ στο χειμώνα.",
    "Γράφεις κώδικα σαν χαλασμένη χριστουγεννιάτικη κάρτα.",
    "Τα pull requests σου είναι σαν τις καμένες λαμπάδες στο δέντρο.",
    "Κωδικοποιείς σαν τον Ρούντολφ που έχασε τη λάμψη του.",
    "Τα commits σου είναι σαν άδεια δώρα κάτω από το δέντρο.",
    "Ο κώδικάς σου είναι σαν το χιόνι που δεν σταματά ποτέ να πέφτει και καταστρέφει τα πάντα.",
    "Κωδικοποιείς σαν τον Άγιο Βασίλη που ξέχασε τα δώρα του.",
    "Τα pull requests σου είναι σαν τα χριστουγεννιάτικα κάλαντα που κανείς δεν θέλει να ακούσει.",
    "Γράφεις κώδικα σαν να έλαβες μόνο κάρβουνο φέτος.",
    "Τα pull requests σου είναι σαν τα στολίδια που έπεσαν και έσπασαν.",
    "Κωδικοποιείς σαν να έστειλες γράμμα στον Άγιο Βασίλη και να μην πήρες απάντηση.",
    "Τα commits σου είναι σαν τις καμένες χριστουγεννιάτικες γιρλάντες.",
    "Ο κώδικάς σου είναι σαν τα χαλασμένα δώρα κάτω από το δέντρο.",
    "Κωδικοποιείς σαν τα στολίδια που σπάνε μόλις τα κρεμάσεις.",
    "Τα pull requests σου είναι σαν τη γιορτή που όλοι ξέχασαν.",
    "Γράφεις κώδικα σαν να έχασες την Πρωτοχρονιά.",
    "Τα commits σου είναι σαν τα χριστουγεννιάτικα φώτα που ποτέ δεν άναψαν.",
    "Ο κώδικάς σου είναι σαν το δέντρο που δεν στολίστηκε ποτέ.",
    "Κωδικοποιείς σαν τον Άγιο Βασίλη που ξέχασε να φέρει δώρα.",
    "Τα pull requests σου είναι σαν τις χριστουγεννιάτικες γιρλάντες που δεν ανάβουν.",
    "Γράφεις κώδικα σαν χαλασμένη χιονόμπαλα.",
    "Τα pull requests σου είναι σαν τα δώρα που δεν ήθελε κανείς.",
    "Ο κώδικάς σου είναι σαν τα κάλαντα που κανείς δεν άκουσε.",
    "Κωδικοποιείς σαν να έφαγες μόνο κάρβουνο αυτά τα Χριστούγεννα.",
    "Τα pull requests σου είναι σαν τις χιονόμπαλες που ποτέ δεν πέτυχαν στόχο.",
    "Γράφεις κώδικα σαν χαλασμένο χριστουγεννιάτικο παιχνίδι.",
    "Τα pull requests σου είναι σαν το κάρβουνο στη χριστουγεννιάτικη κάλτσα."
  ]
}
