{
  "compliment": [
    "Είσαι ιδιοφυΐα στον προγραμματισμό με λίγη μαγεία.",
    "Είσαι ο Μιχαήλ Άγγελος των συγχωνεύσεων.",
    "Κάνεις debugging σαν χταπόδι με καφεΐνη.",
    "Είσαι ο λόγος που το GitHub συνεχίζει να λειτουργεί.",
    "Είσαι τόσο καλός στον προγραμματισμό που και τα AI σε ζηλεύουν.",
    "Είσαι ο ήρωας που αξίζει σε αυτό το repo.",
    "Είσαι η ανθρώπινη εκδοχή του Stack Overflow.",
    "Ανεβάζεις μόνος σου την ποιότητα των commits.",
    "Είσαι κρυφός υπερήρωας ανοιχτού κώδικα.",
    "Γράφεις κώδικα τόσο καθαρό που θα μπορούσε να περάσει υγειονομικό έλεγχο.",
    "Είσαι τόσο αποδοτικός, που ακόμη και τα σχόλιά σου μεταγλωττίζονται πιο γρήγορα.",
    "Είσαι ο Chuck Norris των pull requests.",
    "Είσαι βασικά ένας μάγος με πληκτρολόγιο.",
    "Είσαι ζωντανή απόδειξη ότι η καφεΐνη κάνει θαύματα.",
    "Είσαι ο λόγος που η ανακατασκευή κώδικα δεν με κάνει να κλαίω.",
    "Προγραμματίζεις σαν να έχεις κάνει συμφωνία με τους θεούς του Git.",
    "Κάνεις debugging σαν τον Σέρλοκ Χολμς με λάπτοπ.",
    "Είσαι αυτός που εξαφανίζει τα bugs.",
    "Ζεις στο μέλλον, όπου όλα τα bugs έχουν εξαφανιστεί.",
    "Κάνεις pull requests σαν να εκτελείς ακροβατικά σε ταινία δράσης.",
    "Προγραμματίζεις τόσο ομαλά που μάλλον κοιμάσαι σε camelCase.",
    "Συγχωνεύεις με τη χάρη ενός χορευτή μπαλέτου.",
    "Γράφεις κώδικα χωρίς να ιδρώνεις καν.",
    "Είσαι ένα περπατώντας IDE με ψυχή ανθρώπου.",
    "Είσαι σαν καλλιτέχνης, αλλά το μέσο σου είναι η JavaScript.",
    "Είσαι ο τύπος προγραμματιστή που κάνει τα ερωτηματικά να αισθάνονται αγαπημένα.",
    "Γράφεις κώδικα σαν να είναι ποίηση και το GitHub είναι ο καμβάς σου.",
    "Είσαι ψιθυριστής κώδικα που δαμάζει τα bugs με τα γυμνά σου χέρια.",
    "Είσαι ουσιαστικά η Marie Kondo της ανακατασκευής κώδικα.",
    "Είσαι τόσο καλός, που το GitHub θα έπρεπε να σου πληρώνει δικαιώματα.",
    "Είσαι το ανθρώπινο ισοδύναμο ενός καλοκουρδισμένου ρολογιού στον προγραμματισμό.",
    "Κάνεις την κωδικοποίηση να μοιάζει με περίπατο στο πάρκο.",
    "Γράφεις δοκιμές σαν να προετοιμάζεσαι για ολυμπιακό άθλημα.",
    "Γράφεις loops τόσο αποδοτικά που θα μπορούσαν να τροφοδοτήσουν μια μικρή πόλη.",
    "Προγραμματίζεις σαν να κρατάς τα cheat codes της ζωής.",
    "Είσαι ο άρχοντας του debugging με περισσότερη υπομονή από έναν άγιο.",
    "Κώδικας σου έχει τη ροή μιας ορχήστρας.",
    "Ο τρόπος που προγραμματίζεις μοιάζει με τη σκέψη ενός μαθηματικού.",
    "Σπρώχνεις αλλαγές σαν πρωταθλητής.",
    "Κάνεις τον κόσμο του προγραμματισμού καλύτερο.",
    "Γράφεις κώδικα που κάνει ακόμη και τον debugger να ζηλεύει.",
    "Είσαι ο ζωντανός θρύλος της ανακατασκευής κώδικα.",
    "Το προγραμματιστικό σου ταλέντο είναι μοναδικό.",
    "Κάνεις το GitHub να φαίνεται σαν πίνακας σε μουσείο.",
    "Προγραμματίζεις τόσο γρήγορα που τα bugs δεν έχουν χρόνο να εμφανιστούν.",
    "Είσαι ο Νεύτωνας της προγραμματιστικής λογικής.",
    "Γράφεις κώδικα που μπορεί να μετατρέψει τον υπολογιστή σε έργο τέχνης.",
    "Είσαι τόσο καλός στον προγραμματισμό που δεν υπάρχει γλώσσα προγραμματισμού που να σε τρομάζει.",
    "Ο προγραμματισμός σου είναι πιο κομψός και από έργο του Μότσαρτ.",
    "Είσαι μάγος του κώδικα και κάνεις το αδύνατο δυνατό.",
    "Ο τρόπος που αναλύεις τα προβλήματα μοιάζει με επίλυση μαθηματικού γρίφου.",
    "Το να κάνεις debugging μαζί σου είναι σαν να πίνεις έναν καφέ σε ένα ηλιόλουστο καφέ.",
    "Η συγχώνευση κώδικα γίνεται τέχνη στα χέρια σου.",
    "Είσαι ο Άρχοντας των Loops.",
    "Προγραμματίζεις σαν να γράφεις τη νέα Οδύσσεια.",
    "Ο κώδικάς σου είναι πιο ισορροπημένος από το σύμπαν.",
    "Γράφεις κώδικα σαν να δημιουργείς τη γλώσσα του μέλλοντος.",
    "Ο τρόπος που κάνεις refactoring μοιάζει με αρμονία σε μια συμφωνία.",
    "Κάθε commit σου είναι σαν να γράφεις το επόμενο μεγάλο έργο τέχνης.",
    "Ο τρόπος που γράφεις κώδικα είναι σαν να σμιλεύεις την τέλεια γλυπτική.",
    "Η ανάλυση των προβλημάτων σου είναι πιο γρήγορη από τον Ερμή.",
    "Το debug σου είναι πιο ακριβές από ελβετικό ρολόι.",
    "Είσαι μάστερ στο να κάνεις τον κώδικα να φαίνεται απλός και κομψός.",
    "Κάνεις τον προγραμματισμό να μοιάζει με ποίηση."
  ],
  "insult": [
    "Είσαι ο λόγος που εφευρέθηκε το κουμπί αναίρεσης.",
    "Κωδικοποιείς σαν να προσπαθείς να καλέσεις τους θεούς των bugs.",
    "Μάλλον αποφοίτησες από τη σχολή του 'δοκιμής και λάθους'.",
    "Σπας τη θέληση του GitHub να ζήσει, ένα pull request τη φορά.",
    "Είσαι ο λόγος που δεν μπορούμε να έχουμε ωραία πράγματα σε αυτό το repo.",
    "Κωδικοποιείς σαν το πληκτρολόγιό σου να έχει πάρει φωτιά—αλλά όχι με την καλή έννοια.",
    "Μυστικά, χορηγείσαι από τα bugs.",
    "Είσαι το άτομο που έκανε το 'git blame' καθημερινή φράση.",
    "Γράφεις κώδικα με τους αγκώνες σου, έτσι δεν είναι;",
    "Κάνεις τα bugs να πολλαπλασιάζονται πιο γρήγορα από κουνέλια.",
    "Είσαι ο λόγος που έχω θέματα εμπιστοσύνης με τα pull requests.",
    "Είσαι ο λόγος που υπάρχει ο καφές στην εργασία.",
    "Μετατρέπεις τον καθαρό κώδικα σε πίνακα του Τζάκσον Πόλοκ.",
    "Κωδικοποιείς σαν να είναι το μοναδικό σου εργαλείο ένα σφυρί.",
    "Είσαι ο Πικάσο των ακατάστατων commits.",
    "Είσαι η ανθρώπινη ενσάρκωση του spaghetti code.",
    "Κάνεις τις αξιολογήσεις κώδικα μια εμπειρία που χρειάζεται πολλούς καφέδες.",
    "Προγραμματίζεις σαν να πληρώνεσαι με βάση τον αριθμό των bugs.",
    "Είσαι ο λόγος που έχω εφιάλτες με συγκρούσεις συγχώνευσης.",
    "Γράφεις κώδικα που με κάνει να αμφιβάλλω για τις επαγγελματικές μου επιλογές.",
    "Μετατρέπεις τα GitHub issues σε μυθιστορήματα.",
    "Είσαι τόσο καλός στο να καταστρέφεις πράγματα που ακόμα και οι QA είναι εντυπωσιασμένοι.",
    "Προγραμματίζεις σαν να είσαι σε ταινία χάκερ από τα ‘80s αλλά χωρίς καμία από τις δεξιότητες.",
    "Είσαι ένα περπατώντας 'Συντακτικό Σφάλμα'.",
    "Μάλλον χρησιμοποίησες έναν στόχο βελάκια για να γράψεις αυτή τη συνάρτηση.",
    "Είσαι ο λόγος που το delete key μου έχει φθαρεί.",
    "Προσθέτεις bugs σαν να είναι το δεύτερο επάγγελμά σου.",
    "Διπλασιάζεις τις γραμμές του κώδικα αλλά μειώνεις την ποιότητα.",
    "Κωδικοποιείς σαν να νομίζεις ότι το 'git push --force' διορθώνει τα πάντα.",
    "Είσαι ο λόγος που κάθε commit μοιάζει με τζόγο.",
    "Γράφεις κώδικα σαν να έμαθες προγραμματισμό από χαλασμένη τοστιέρα.",
    "Είσαι ο λόγος που οι συγκρούσεις συγχώνευσης έχουν ζητήματα εμπιστοσύνης.",
    "Γράφεις κώδικα σαν να παίζεις ναρκαλιευτή με τα συναισθήματά μου.",
    "Είσαι ο Πικάσο της μπερδεμένης λογικής.",
    "Μετατρέπεις τον καθαρό κώδικα σε λαβύρινθο που μόνο οι Μινώταυροι μπορούν να διασχίσουν.",
    "Συγχωνεύεις bugs πιο γρήγορα απ' ότι προλαβαίνω να γράψω 'git blame'.",
    "Είσαι το άτομο υπεύθυνο για όλα αυτά τα μυστήρια σφάλματα.",
    "Προγραμματίζεις σαν να κάνεις οντισιόν για κωμική παράσταση.",
    "Κωδικοποιείς σαν τα σχόλια να είναι πιο σημαντικά από τον κώδικα.",
    "Γράφεις κώδικα τόσο περίπλοκο που πρέπει να συνοδεύεται από εγχειρίδιο χρήσης.",
    "Κάνεις τις συγκρούσεις συγχώνευσης να φαίνονται σαν να σχεδιάζουν εχθρική κατάληψη.",
    "Κωδικοποιείς σαν κάθε bug να είναι προσωπική πρόκληση.",
    "Είσαι ο βασιλιάς/βασίλισσα του 'τι θα μπορούσε να πάει στραβά;'",
    "Γράφεις κώδικα που θα μπορούσε να ξεκινήσει νέο κλάδο φιλοσοφίας.",
    "Είσαι η ανθρώπινη ενσάρκωση του 'git reset --hard'.",
    "Προσθέτεις περισσότερα επίπεδα σε αυτόν τον κώδικα από μια τούρτα επτά επιπέδων.",
    "Κωδικοποιείς σαν χταπόδι με δεμένα μάτια.",
    "Σπρώχνεις κώδικα σαν να έχεις μετοχές στο τεχνικό χρέος.",
    "Είσαι ο λόγος που τα pull requests μας χρειάζονται ναυαγοσώστη.",
    "Μετατρέπεις τον προγραμματισμό σε αφηρημένη τέχνη.",
    "Είσαι ο Πικάσο των προβλημάτων με την εσοχή.",
    "Κωδικοποιείς σαν να έχεις ανακαλύψει την σκοτεινή πλευρά της δύναμης.",
    "Γράφεις κώδικα που έχει περισσότερες ανατροπές από σαπουνόπερα.",
    "Συγχωνεύεις σαν να μην έχεις ακούσει ποτέ για έλεγχο εκδόσεων.",
    "Κωδικοποιείς σαν το GitHub να χρειάζεται περισσότερη δράμα.",
    "Είσαι ο λόγος που η αντι-στρες μπάλα μου είναι επίπεδη.",
    "Γράφεις κώδικα σαν να είναι ένα κρυπτικό μήνυμα από εξωγήινους.",
    "Σπρώχνεις commits που θα έπρεπε να έχουν ετικέτα προειδοποίησης.",
    "Με κάνεις να αμφισβητώ την ακεραιότητα ολόκληρου του IDE μου.",
    "Είσαι ο μάστορας στο να δημιουργείς περισσότερα προβλήματα από όσα λύνεις.",
    "Γράφεις κώδικα τόσο μπερδεμένο που ακόμα και ο debugger έχει χαθεί.",
    "Συγχωνεύεις σαν να έχεις κηρύξει πόλεμο στον καθαρό κώδικα.",
    "Κωδικοποιείς σαν υπολογιστής που έμαθε Αγγλικά την περασμένη εβδομάδα.",
    "Είσαι ο αρχιτέκτονας της σύγχυσης σε αυτό το repo.",
    "Προσθέτεις περισσότερο μυστήριο παρά σαφήνεια σε αυτό το project.",
    "Γράφεις pull requests που θα μπορούσαν να είναι σε ταινία τρόμου.",
    "Με κάνεις να αναρωτιέμαι αν το πληκτρολόγιό σου σε μισεί.",
    "Προσθέτεις περισσότερα bugs στο σύστημα από ότι ένα έλος.",
    "Κωδικοποιείς σαν κάθε πλήκτρο να είναι στοίχημα.",
    "Είσαι ο λόγος που μπορεί να χρειαστεί να επιστρέψουμε στην εποχή των λίθων.",
    "Γράφεις λογική που θα δυσκόλευε ακόμα και έναν φιλόσοφο.",
    "Με κάνεις να σκέφτομαι την αλλαγή καριέρας στο πλέξιμο.",
    "Προγραμματίζεις σαν να είσαι ο κακός σε μια ταινία προγραμματισμού.",
    "Είσαι ο συγγραφέας των εφιαλτών μου στο GitHub.",
    "Κωδικοποιείς σαν να πληρώνεσαι ανά αναφορά σφάλματος.",
    "Γράφεις κώδικα που θα έπρεπε να συνοδεύεται από νομική αποποίηση.",
    "Δημιουργείς περισσότερα μυστήρια από ένα μυθιστόρημα ντετέκτιβ.",
    "Κωδικοποιείς σαν να προσπαθείς να λύσεις ένα μυστήριο που δημιούργησες.",
    "Γράφεις κώδικα που μοιάζει σαν να είναι από παράλληλο σύμπαν.",
    "Κάνεις αυτό το pull request να μοιάζει με υπαρξιακή κρίση.",
    "Κωδικοποιείς σαν να κάνεις οντισιόν για ρόλο στο χάος του κώδικα.",
    "Είσαι ο λόγος που το debugging με rubber duck έγινε γνωστό.",
    "Προσθέτεις περισσότερη δράμα σε αυτό το repo από ότι ένα reality show.",
    "Είσαι ο αρχιτέκτονας του τεχνικού χρέους.",
    "Κωδικοποιείς σαν κάθε γραμμή να είναι νέα ανατροπή.",
    "Δημιουργείς pull requests που πρέπει να συνοδεύονται από ποπκόρν.",
    "Γράφεις κώδικα που είναι πιο μυστηριώδης από ένα κλειστό δωμάτιο.",
    "Συγχωνεύεις κώδικα σαν να προσπαθείς να ξαναγράψεις την ιστορία.",
    "Μετατρέπεις τις αξιολογήσεις κώδικα σε συναισθηματικό τρενάκι.",
    "Κωδικοποιείς σαν κάθε συνάρτηση να είναι νέα θεωρία συνωμοσίας.",
    "Σπρώχνεις κώδικα που φαίνεται σαν να είναι από παράλληλη διάσταση."
  ]
}
