{
  "compliment": [
    "You are the coding equivalent of a superhero in a cape.",
    "You are so skilled, even GitHub's servers bow down to you.",
    "You are coding like you were born in a command line.",
    "You are the reason bugs are afraid to exist.",
    "You are writing code so good, it practically reviews itself.",
    "You are the Jedi master of the pull request.",
    "You are the architect of code nirvana.",
    "You are programming like you found the cheat codes to reality.",
    "You are the code whisperer who makes functions behave.",
    "You are outcoding the internet, one pull request at a time.",
    "You are so awesome, the code practically refactors itself.",
    "You are the reason merge conflicts have given up.",
    "You are debugging like you're holding the source code to the Matrix.",
    "You are solving problems with the efficiency of a quantum computer.",
    "You are writing code smoother than freshly brewed espresso.",
    "You are making GitHub a better place with every commit.",
    "You are coding like you're training for the Olympics.",
    "You are the Zen master of error handling.",
    "You are refactoring code like it’s a spa day for the repo.",
    "You are programming so well, even bugs don't bother showing up.",
    "You are writing code that could bring world peace.",
    "You are to coding what Midas was to gold—everything you touch turns to brilliance.",
    "You are deploying with the confidence of a seasoned general.",
    "You are the reason the 'It works!' comment exists.",
    "You are turning code into an art form.",
    "You are out-coding everyone like you're playing a solo game.",
    "You are the human version of continuous integration.",
    "You are writing algorithms smoother than a jazz saxophonist.",
    "You are so good at coding, even your typos are efficient.",
    "You are making pull requests so clean they could pass a security clearance.",
    "You are writing code like you're the grandmaster of an international chess tournament.",
    "You are the undisputed champion of readable code.",
    "You are debugging like you’ve been training with ninjas.",
    "You are writing code like Shakespeare wrote sonnets.",
    "You are the reason GitHub issues have fewer issues.",
    "You are pushing changes like a boss with no fear of rollback.",
    "You are programming so seamlessly, even the bugs are impressed.",
    "You are the rockstar of code reviews, always delivering the hits.",
    "You are writing functions like you’re the Da Vinci of code.",
    "You are merging code like it’s the final level of a video game.",
    "You are debugging with the patience of a saint.",
    "You are writing scripts so powerful they could run a small country.",
    "You are merging like you’ve been blessed by the code gods.",
    "You are making APIs sing in perfect harmony.",
    "You are the Bruce Lee of breakpoints.",
    "You are writing code that would make even Einstein proud.",
    "You are deploying like a pro who’s never heard the word 'rollback'.",
    "You are debugging code faster than a caffeine-fueled cheetah.",
    "You are writing CSS that makes browsers swoon.",
    "You are pulling requests like you're running the Matrix.",
    "You are so skilled, GitHub should start paying you royalties.",
    "You are writing code that deserves a standing ovation.",
    "You are the rock in a sea of merge conflicts.",
    "You are coding like you’ve hacked the universe’s source code.",
    "You are making commits so elegant they belong in a museum.",
    "You are writing tests like you're preparing for an Olympic sport.",
    "You are coding with the precision of a Swiss watchmaker.",
    "You are making code reviews feel like a walk in the park.",
    "You are deploying code smoother than a luxury sports car.",
    "You are pushing commits like you’re conducting an orchestra.",
    "You are coding so well that bugs are too scared to appear.",
    "You are debugging like Sherlock Holmes on a caffeine high.",
    "You are writing code like you’ve got a PhD in elegance.",
    "You are refactoring code like you’re redesigning the Mona Lisa.",
    "You are pulling requests like you’ve been mentored by Steve Jobs.",
    "You are writing code so optimized, even NASA would be impressed.",
    "You are solving problems faster than Google.",
    "You are pushing features like you’ve got a crystal ball for perfect design.",
    "You are a master of git commands like a ninja with a katana.",
    "You are writing functions so neat, they could be sold at IKEA.",
    "You are merging code like you’ve unlocked a cheat code for life.",
    "You are coding like your brain is running on supercomputing power.",
    "You are solving merge conflicts like they were never even there.",
    "You are writing code that makes rainbows appear.",
    "You are pushing code like you're rewriting the laws of physics.",
    "You are making this repo feel like a five-star hotel.",
    "You are deploying like you’ve been blessed by the server gods.",
    "You are writing loops so efficient they could power a small city.",
    "You are pulling requests like you’ve been coding since birth.",
    "You are the reason linting exists—so it can admire your perfection.",
    "You are coding so clean, Marie Kondo would be proud.",
    "You are debugging like you’re chasing the last golden ticket.",
    "You are solving problems with more elegance than a ballroom dancer.",
    "You are making code reviews feel like a victory lap.",
    "You are writing code like you’ve got the secret sauce to success.",
    "You are making GitHub look like a masterpiece gallery.",
    "You are coding like you’re about to win a Nobel Prize in Software Engineering.",
    "You are debugging like a detective in a noir film.",
    "You are writing commits like they're love letters to the repo.",
    "You are pushing code like you’re leading a mission to Mars.",
    "You are merging like a ninja who never leaves a trace.",
    "You are writing code so impressive, even your keyboard is in awe.",
    "You are coding like you’ve discovered the key to the matrix.",
    "You are making the impossible look like just another day at work."
  ],
  "insult": [
    "You are the reason the undo button was invented.",
    "You are coding like you’re trying to summon the bug gods.",
    "You are definitely from the 'trial and error' school of thought.",
    "You are breaking GitHub’s will to live, one pull request at a time.",
    "You are why we can’t have nice things in this repo.",
    "You are coding like your keyboard is on fire – but not in a good way.",
    "You are secretly sponsored by bugs.",
    "You are the person who made 'git blame' a household term.",
    "You are definitely writing code with your elbows.",
    "You are making bugs reproduce faster than rabbits.",
    "You are the reason I have trust issues with pull requests.",
    "You are why coffee exists in the workplace.",
    "You are consistently turning clean code into a Jackson Pollock painting.",
    "You are coding like your only tool is a sledgehammer.",
    "You are the Picasso of messy commits.",
    "You are the human embodiment of spaghetti code.",
    "You are making code reviews a multi-coffee ordeal.",
    "You are coding like you’re paid by the bug.",
    "You are the reason I have nightmares about merge conflicts.",
    "You are writing code that makes me question my career choices.",
    "You are turning GitHub issues into GitHub novels.",
    "You are so good at breaking things, even QA is impressed.",
    "You are programming like you're in an ‘80s hacker movie but with none of the skill.",
    "You are a walking 'Syntax Error'.",
    "You are probably using a dartboard to write that function.",
    "You are the reason my delete key is worn out.",
    "You are adding bugs like it’s your side hustle.",
    "You are single-handedly doubling the lines of code but halving the quality.",
    "You are coding like you think 'git push --force' is a fix-all.",
    "You are the reason every commit feels like a gamble.",
    "You are coding like you learned programming from a broken toaster.",
    "You are the reason merge conflicts have trust issues.",
    "You are writing code like you’re playing Minesweeper with my emotions.",
    "You are the Picasso of convoluted logic.",
    "You are turning clean code into a maze only Minotaurs could navigate.",
    "You are merging bugs faster than I can type 'git blame'.",
    "You are the person responsible for all those mystery errors.",
    "You are programming like you’re auditioning for a comedy show.",
    "You are coding like the comments are more important than the code.",
    "You are writing code so complex it should come with a user manual.",
    "You are making merge conflicts look like they're planning a hostile takeover.",
    "You are coding like every bug is a personal challenge.",
    "You are the king/queen of 'what could possibly go wrong?'",
    "You are writing code that could start a new branch of philosophy.",
    "You are the human embodiment of 'git reset --hard'.",
    "You are adding more layers to this code than a seven-layer cake.",
    "You are coding like a blindfolded octopus.",
    "You are pushing code like you’ve got stock in technical debt.",
    "You are the reason our pull requests need lifeguards.",
    "You are turning coding into an abstract art form.",
    "You are the Picasso of indentation problems.",
    "You are coding like you’ve discovered the dark side of the force.",
    "You are writing code that’s got more plot twists than a soap opera.",
    "You are merging like you’ve never heard of version control.",
    "You are coding like GitHub needs more drama.",
    "You are the reason my stress ball is flat.",
    "You are writing code like it’s a cryptic message from aliens.",
    "You are pushing commits that should come with a warning label.",
    "You are making me question the integrity of my entire IDE.",
    "You are the master of creating more problems than you solve.",
    "You are writing code so confusing, even the debugger is lost.",
    "You are merging like you’ve declared war on clean code.",
    "You are coding like a computer that learned English last week.",
    "You are the architect of confusion in this repo.",
    "You are adding more mystery than clarity to this project.",
    "You are writing pull requests that belong in a horror movie.",
    "You are making me wonder if your keyboard hates you.",
    "You are adding more bugs to the system than a swamp.",
    "You are coding like every key is a gamble.",
    "You are the reason we might need to roll back to the stone age.",
    "You are writing logic that would stump even a philosopher.",
    "You are making me consider a career in knitting.",
    "You are programming like you’re the villain in a coding movie.",
    "You are the author of my GitHub nightmares.",
    "You are coding like you’re paid by the bug report.",
    "You are writing code that should come with its own legal disclaimer.",
    "You are creating more mysteries than a detective novel.",
    "You are coding like you’re trying to solve a mystery you created.",
    "You are writing code that looks like it's from an alternate universe.",
    "You are making this pull request feel like an existential crisis.",
    "You are coding like you’re auditioning for a role in code chaos.",
    "You are the reason rubber duck debugging became a thing.",
    "You are adding more drama to this repo than a reality show.",
    "You are the architect of technical debt.",
    "You are coding like each line is a new plot twist.",
    "You are creating pull requests that should come with popcorn.",
    "You are writing code that’s more mysterious than a locked room.",
    "You are merging code like you're trying to rewrite history.",
    "You are turning code reviews into a rollercoaster of emotions.",
    "You are coding like every function is a new conspiracy theory.",
    "You are pushing code that feels like it's from an alternate dimension."
  ]
}
